[Killed] MethodCallRemoval
Illuminate/Providers/ConfigServiceProvider.php:19:9
 {
     public function register()
     {
-        Event::listen(
-            CommandStarting::class,
-            function (CommandStarting $event) {
-                if ($event->command === ConfigCacheCommand::getDefaultName()) {
-                    exportify(
-                        Config::getFacadeRoot()
-                    );
-                }
-            }
-        );
+        
     }
 }
killedBy: Henzeb\VarExportWrapper\Tests\Unit\Illuminate\Providers\ConfigServiceProviderTest::testShouldPrepareConfigForCache
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\Illuminate\Providers\ConfigServiceProviderTest::testShouldPrepareConfigForCache
Failed asserting that Closure Object (...) is an instance of class "Henzeb\VarExportWrapper\VarExportable".

/home/henze/PhpstormProjects/var-export-wrapper/tests/Unit/Illuminate/Providers/ConfigServiceProviderTest.php:54
/home/henze/PhpstormProjects/var-export-wrapper/vendor/orche

[Killed] Identical
Illuminate/Providers/ConfigServiceProvider.php:22:17
         Event::listen(
             CommandStarting::class,
             function (CommandStarting $event) {
-                if ($event->command === ConfigCacheCommand::getDefaultName()) {
+                if ($event->command !== ConfigCacheCommand::getDefaultName()) {
                     exportify(
                         Config::getFacadeRoot()
killedBy: Henzeb\VarExportWrapper\Tests\Unit\Illuminate\Providers\ConfigServiceProviderTest::testShouldPrepareConfigForCache
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\Illuminate\Providers\ConfigServiceProviderTest::testShouldPrepareConfigForCache
Failed asserting that Closure Object (...) is an instance of class "Henzeb\VarExportWrapper\VarExportable".

/home/henze/PhpstormProjects/var-export-wrapper/tests/Unit/Illuminate/Providers/ConfigServiceProviderTest.php:54
/home/henze/PhpstormProjects/var-export-wrapper/vendor/orche

[Killed] FunctionCallRemoval
Illuminate/Providers/ConfigServiceProvider.php:23:21
             CommandStarting::class,
             function (CommandStarting $event) {
                 if ($event->command === ConfigCacheCommand::getDefaultName()) {
-                    exportify(
-                        Config::getFacadeRoot()
-                    );
+                    
                 }
             }
killedBy: Henzeb\VarExportWrapper\Tests\Unit\Illuminate\Providers\ConfigServiceProviderTest::testShouldPrepareConfigForCache
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\Illuminate\Providers\ConfigServiceProviderTest::testShouldPrepareConfigForCache
Failed asserting that Closure Object (...) is an instance of class "Henzeb\VarExportWrapper\VarExportable".

/home/henze/PhpstormProjects/var-export-wrapper/tests/Unit/Illuminate/Providers/ConfigServiceProviderTest.php:54
/home/henze/PhpstormProjects/var-export-wrapper/vendor/orche
