[Killed] InstanceOf_
VarExportable.php:22:9
         object $var
     )
     {
-        if ($var instanceof Closure) {
+        if (true) {
             $var = new SerializableClosure($var);
         }
killedBy: Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithRegularClass
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithRegularClass
TypeError: Laravel\SerializableClosure\SerializableClosure::__construct(): Argument #1 ($closure) must be of type Closure, Henzeb\VarExportWrapper\Tests\Fixtures\RegularClass given, called in /home/henze/PhpstormProjects/var-export-wrapper/src/VarExportable.php on line 19

/home/henze/PhpstormProjects/var-expor

[Killed] InstanceOf_
VarExportable.php:22:9
         object $var
     )
     {
-        if ($var instanceof Closure) {
+        if (false) {
             $var = new SerializableClosure($var);
         }
killedBy: Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithClosure
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithClosure
Exception: Serialization of 'Closure' is not allowed

/home/henze/PhpstormProjects/var-export-wrapper/src/VarExportable.php:28
/home/henze/PhpstormProjects/var-export-wrapper/src/Support/Functions.php:33
/home/henze/PhpstormProjects/var-export-wrapper/tests/Unit/Support/FunctionsTest.php:17

ERRORS!

[Killed] IfNegation
VarExportable.php:29:9
         /**
          * If the object implements __set_state, it does not need to serialize
          */
-        if (is_exportable($var)) {
-            $this->object = $var;
-            return;
-        }
+        if (!is_exportable($var)) {
 
         $this->object = serialize(
killedBy: Henzeb\VarExportWrapper\Tests\Unit\VarExportableTest::testExportsClosure
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\VarExportableTest::testExportsClosure
Error: Call to undefined method Laravel\SerializableClosure\SerializableClosure::__set_state()

/home/henze/PhpstormProjects/var-export-wrapper/tests/Unit/VarExportableTest.php:34

ERRORS!
Tests: 7, Assertions: 29, Errors: 1.

[Killed] IfNegation
VarExportable.php:46:9
 
     private static function setState($export): object
     {
-        if (is_string($export)) {
-            $export = unserialize($export);
-        }
+        if (!is_string($export)) {
 
         if ($export instanceof SerializableClosure
killedBy: Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithClosure
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithClosure
TypeError: Henzeb\VarExportWrapper\VarExportable::setState(): Return value must be of type object, string returned

/home/henze/PhpstormProjects/var-export-wrapper/src/VarExportable.php:42
/home/henze/PhpstormProjects/var-export-wrapper/src/VarExportable.php:49
/home/henze/PhpstormProjects/var-export-wrapper/tests/U

[Killed] LogicalOrAllSubExprNegation
VarExportable.php:50:9
             $export = unserialize($export);
         }
 
-        if ($export instanceof SerializableClosure
-            || $export instanceof UnsignedSerializableClosure
+        if (!$export instanceof SerializableClosure || !$export instanceof UnsignedSerializableClosure) {ableClosure
         ) {
             $export = $export->getClosure();
killedBy: Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithRegularClass
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithRegularClass
Error: Call to undefined method Henzeb\VarExportWrapper\Tests\Fixtures\RegularClass::getClosure()

/home/henze/PhpstormProjects/var-export-wrapper/src/VarExportable.php:40
/home/henze/PhpstormProjects/var-export-wrapper/src/VarExportable.php:49
/home/henze/PhpstormProjects/var-export-wrapper/tests/Unit/Support/

[Killed] InstanceOf_
VarExportable.php:50:9
             $export = unserialize($export);
         }
 
-        if ($export instanceof SerializableClosure
+        if (true || $export instanceof UnsignedSerializableClosure) {
             || $export instanceof UnsignedSerializableClosure
         ) {
killedBy: Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithRegularClass
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithRegularClass
Error: Call to undefined method Henzeb\VarExportWrapper\Tests\Fixtures\RegularClass::getClosure()

/home/henze/PhpstormProjects/var-export-wrapper/src/VarExportable.php:40
/home/henze/PhpstormProjects/var-export-wrapper/src/VarExportable.php:49
/home/henze/PhpstormProjects/var-export-wrapper/tests/Unit/Support/

[Killed] InstanceOf_
VarExportable.php:51:13
         }
 
         if ($export instanceof SerializableClosure
-            || $export instanceof UnsignedSerializableClosure
+            if ($export instanceof SerializableClosure || false) {
         ) {
             $export = $export->getClosure();
killedBy: Henzeb\VarExportWrapper\Tests\Unit\VarExportableTest::testExportsUnsignedSerializableClosure
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\VarExportableTest::testExportsUnsignedSerializableClosure
Failed asserting that Laravel\SerializableClosure\UnsignedSerializableClosure Object (...) is an instance of class "Closure".

/home/henze/PhpstormProjects/var-export-wrapper/tests/Unit/VarExportableTest.php:81

FAILURES!
Tests: 9, Assertions: 36, Failures: 1.

[Killed] InstanceOf_
VarExportable.php:51:13
         }
 
         if ($export instanceof SerializableClosure
-            || $export instanceof UnsignedSerializableClosure
+            if ($export instanceof SerializableClosure || true) {
         ) {
             $export = $export->getClosure();
killedBy: Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithRegularClass
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithRegularClass
Error: Call to undefined method Henzeb\VarExportWrapper\Tests\Fixtures\RegularClass::getClosure()

/home/henze/PhpstormProjects/var-export-wrapper/src/VarExportable.php:40
/home/henze/PhpstormProjects/var-export-wrapper/src/VarExportable.php:49
/home/henze/PhpstormProjects/var-export-wrapper/tests/Unit/Support/

[Killed] PublicVisibility
VarExportable.php:62:5
     /**
      * @return Closure|mixed|object
      */
-    public function getObject()
+    protected function getObject()
     {
         return self::setState($this->object);
killedBy: Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithClosure
statusReason: 1) Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest::testExportWithClosure
Error: Call to protected method Henzeb\VarExportWrapper\VarExportable::getObject() from scope Henzeb\VarExportWrapper\Tests\Unit\Support\FunctionsTest

/home/henze/PhpstormProjects/var-export-wrapper/tests/Unit/Support/FunctionsTest.php:26

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.
